app/views/users/index.html.erb

        </li>
        <li><small><%= pluralize(user.memories.count, "memory") if user.memories %></small></li>
---
SELECT COUNT(*) FROM "memories" WHERE "memories"."user_id" = ?  [["user_id", 1]]