app/controllers/memories_controller.rb

  def index
    @memories = Memory.paginate(page: params[:page], per_page: 5)
---
SELECT  "memories".* FROM "memories" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "memories"

  def create
    @memory = Memory.new(memory_params)
    @memory.user = current_user
    if @memory.save
---
INSERT INTO "memories" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Anniversary"], ["description", "Today is my 5th Anniversary"], ["user_id", 2], ["created_at", "2016-01-15 07:10:25.286496"], ["updated_at", "2016-01-15 07:10:25.286496"]]

  def destroy
    @memory.destroy
---
DELETE FROM "memories" WHERE "memories"."id" = ?  [["id", 1]]

  def set_memory
    @memory = Memory.find(params[:id])
---
SELECT  "memories".* FROM "memories" WHERE "memories"."id" = ? LIMIT 1  [["id", 1]]