app/controllers/users_controller.rb

SELECT  "memories".* FROM "memories" WHERE "memories"."user_id" = ? LIMIT 5 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "memories" WHERE "memories"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user_memories = @user.memories.paginate(page: params[:page], per_page: 5)