app/views/memories/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "memories" WHERE "memories"."user_id" = ?  [["user_id", 2]]
---
        <li><small>
        <%= pluralize(@memory.user.memories.count, "memory") if @memory.user.memories %>